import { h } from 'vue'
import type { HelpInfo } from '@/types'

const helpInfo: HelpInfo = {
  DailyTasks: {
    MainSiteTasks: {
      login: {
        title: '每日登录',
        message: '完成主站的每日登录任务。',
      },
      watch: {
        title: '每日观看视频',
        message: () =>
          h('p', [
            h('div', '完成主站的每日观看视频任务。'),
            h('div', '从动态中选取视频观看，会产生观看历史记录。'),
          ]),
      },
      coin: {
        title: '每日投币',
        message: () =>
          h('p', [
            h('div', '完成主站的每日投币任务。'),
            h('div', '从动态中选取视频投币，会根据你今天已经投过的币的数量计算还要投几个币。'),
          ]),
      },
      share: {
        title: '每日分享视频',
        message: () =>
          h('p', [h('div', '完成主站的每日分享视频任务。'), h('div', '不会真的分享到某处。')]),
      },
    },
    LiveTasks: {
      medalTasks: {
        list: {
          title: '黑白名单 / 排序模式',
          message: () =>
            h('p', [
              h('div', '每个直播任务都有自己独立的黑名单或白名单。'),
              h('ul', [
                h('li', [
                  h('span', '黑名单：仅为'),
                  h('strong', '不在'),
                  h('span', '名单中的粉丝勋章执行任务。'),
                ]),
                h('li', [
                  h('span', '白名单：仅为'),
                  h('strong', '在'),
                  h('span', '名单中的粉丝勋章执行任务。'),
                ]),
              ]),
              h('div', '点击【编辑名单】按钮，然后使用第一列的多选框即可编辑名单中的粉丝勋章。'),
              h(
                'div',
                '使用白名单模式时，点击【编辑粉丝勋章名单】窗口右下角的开关即可在【常规模式】和【排序模式】之间切换。',
              ),
              h('div', '在排序模式下，你可以调整脚本执行任务的粉丝勋章顺序。'),
              h('ul', [
                h('li', '使用鼠标拖拽表格中的行来调整顺序。'),
                h('li', '拖拽行至表格的顶部和底部可以触发滚动。'),
              ]),
            ]),
        },
        light: {
          title: '点亮熄灭勋章',
          message: () =>
            h('p', [
              h('div', '在你的每个已熄灭的粉丝勋章对应的直播间完成点亮任务，从而点亮粉丝勋章。'),
              h('div', '根据直播间是否开播，脚本会自动选择点亮方式：'),
              h('ol', [
                h(
                  'li',
                  h('p', [
                    h('strong', '点赞'),
                    h('div', '对于正在直播的房间，给直播间点赞。'),
                    h('div', '脚本会根据 B 站返回的任务要求自动决定点赞次数。'),
                  ]),
                ),
                h(
                  'li',
                  h('p', [
                    h('strong', '发送弹幕'),
                    h('div', '对于未开播的房间，发送数条弹幕。'),
                    h(
                      'div',
                      '脚本会根据 B 站返回的任务要求自动决定发送条数。发送失败时会自动小幅补发。',
                    ),
                    h('div', [
                      h(
                        'div',
                        '点击【编辑弹幕】按钮编辑要发送的弹幕，脚本会从中按顺序循环抽取弹幕发送。建议修改默认的弹幕。',
                      ),
                      h('div', '部分直播间无法完成该任务，可能的原因有:'),
                      h('ul', [
                        h('li', '你被禁言了'),
                        h('li', '发言有粉丝勋章等级要求'),
                        h('li', '发送的弹幕包含屏蔽词'),
                        h('li', [
                          h('span', '特殊直播间（比如'),
                          h(
                            'a',
                            {
                              href: 'https://live.bilibili.com/54',
                              rel: 'noreferrer',
                              target: '_blank',
                            },
                            '54',
                          ),
                          h('span', '）'),
                        ]),
                      ]),
                    ]),
                  ]),
                ),
              ]),
              h('div', [
                h('strong', '注意：'),
                h('ul', [
                  h('li', '点赞、发弹幕和观看直播任务都会等点亮熄灭勋章任务完成后再执行。'),
                  h(
                    'li',
                    '熄灭的勋章被点亮后，通过完成任务获得的亲密度会被储蓄。需要投喂一个粉丝灯牌才能领取。',
                  ),
                ]),
              ]),
            ]),
        },
        rounds: {
          title: '跟随每日上限 / 完成目标轮次',
          message: () =>
            h('p', [
              h(
                'div',
                '一轮指通过完成任务获得 +1 亲密度所需的最小操作量。具体值脚本会在运行过程中实时获取。根据观察目前每轮的操作量如下：',
              ),
              h('ul', [
                h('li', '点赞：30 次'),
                h('li', '发弹幕：1 条'),
                h('li', '观看直播：15 分钟'),
              ]),
              h(
                'div',
                '选择【跟随每日上限】时，脚本会尽量做到任务的当日上限（任务上限也是实时获取的）。',
              ),
              h(
                'div',
                '选择【完成目标轮次】可自定义脚本当天至多完成几轮；若填写值超过任务上限，则还是做到任务的当日上限。',
              ),
            ]),
        },
        like: {
          title: '点赞',
          message: () =>
            h('p', [
              h('div', '为已点亮的粉丝勋章完成粉丝团升级任务中的点赞任务。'),
              h('div', '只有主播开播时点赞才会计入任务进度。'),
            ]),
        },
        likeWaitUntilLiving: {
          title: '等待开播后再点赞',
          message: () =>
            h('p', [
              h(
                'div',
                '开启该功能后，对于尚未开播的直播间，脚本会等主播开播后再点赞。关闭时会直接跳过。',
              ),
            ]),
        },
        danmu: {
          title: '发弹幕',
          message: () =>
            h('p', [
              h('div', '为已点亮的粉丝勋章完成粉丝团升级任务中的发弹幕任务。'),
              h('ul', [
                h(
                  'li',
                  '点击【编辑弹幕】按钮编辑要发送的弹幕，脚本会从中按顺序循环抽取弹幕发送。建议修改默认的弹幕。',
                ),
                h('li', '弹幕发送失败（比如被屏蔽词拦截）会自动小幅补发。'),
              ]),
            ]),
        },
        danmuWaitUntilNotLiving: {
          title: '等待下播后再发弹幕',
          message: () =>
            h('p', [
              h('div', '此选项只有在开启【仅在未开播的直播间发弹幕】后才会生效。'),
              h('div', '只开启【仅在未开播的直播间发弹幕】时，脚本会直接跳过当前开播中的直播间。'),
              h('div', '此时再开启【等待下播后再发弹幕】，脚本会等直播中的主播下播后再发弹幕。'),
            ]),
        },
        watch: {
          title: '观看直播',
          message: () =>
            h('p', [
              h('div', '为已点亮的粉丝勋章完成完成粉丝团升级任务中的观看直播任务。'),
              h('ul', [
                h('li', '部分直播间因为没有设置直播分区导致任务无法完成。'),
                h('li', '主播当前是否开播不会影响该任务的完成。'),
              ]),
              h('div', [
                h('strong', '注意：'),
                h(
                  'span',
                  '使用本功能时不能以任何方式观看直播（网页、APP、电视），否则可能无法获得任何亲密度。',
                ),
              ]),
            ]),
        },
      },
    },
    OtherTasks: {
      silverToCoin: {
        title: '银瓜子换硬币',
        message: () =>
          h('p', [
            h('div', '把银瓜子兑换为硬币。'),
            h('div', '具体兑换规则请点击直播间页面右下角的“电池图标→银瓜子商店”查看。'),
          ]),
      },
      coinToSilver: {
        title: '硬币换银瓜子',
        message: () =>
          h('p', [
            h('div', '把硬币兑换为银瓜子。'),
            h('div', '具体兑换规则请点击直播间页面右下角的“电池图标→银瓜子商店”查看。'),
          ]),
      },
      getYearVipPrivilege: {
        title: '领取年度大会员权益',
        message: () =>
          h('p', [
            h('div', '自动领取年度大会员权益。'),
            h('div', [
              h('span', '具体权益请前往'),
              h(
                'a',
                {
                  href: 'https://account.bilibili.com/account/big/myPackage',
                  rel: 'noreferrer',
                  target: '_blank',
                },
                '卡券包',
              ),
              h('span', '查看。'),
            ]),
          ]),
      },
    },
  },
  EnhanceExperience: {
    switchLiveStreamQuality: {
      title: '自动切换画质',
      message: () =>
        h('p', [
          h('div', '打开直播间后自动把播放器切换到目标画质。'),
          h('div', '如果目标画质不存在，先查找无HDR版本的画质，仍没有则使用B站的默认画质。'),
        ]),
    },
    banp2p: {
      title: '禁用P2P',
      message: () =>
        h('p', [
          h('div', '禁用直播流的P2P上传/下载'),
          h(
            'div',
            'B站使用WebRTC技术把许多浏览器点对点（P2P）地连接起来，实现视频流和音频流的传输。这样做是为了减轻B站服务器的压力，但是会占用你一定的上行带宽（大约几百kb每秒）。如果你不想被占用上行带宽，可以开启该功能。若开启后发现观看直播时有明显卡顿，请关闭。',
          ),
        ]),
    },
    noReport: {
      title: '拦截日志数据上报',
      message: () =>
        h('p', [
          h('div', '禁止B站上报日志数据。'),
          h('div', [
            h(
              'span',
              'B站会实时地上报大量日志信息，比如直播观看情况、代码报错等等。开启本功能后绝大多数日志上报都会被劫持或拦截并返回一个成功的响应。相比于带有广告拦截功能的浏览器拓展，比如',
            ),
            h(
              'a',
              {
                href: 'https://github.com/uBlockOrigin/uBOL-home',
                rel: 'noreferrer',
                target: '_blank',
              },
              'uBlock Origin Lite',
            ),
            h(
              'span',
              '，本功能会通过劫持的方式从根源上阻止部分日志上报，并模拟成功的响应来尽可能地减少B站代码的报错。理论上来说这样做会有更好的性能表现。',
            ),
          ]),
        ]),
    },
    noSleep: {
      title: '屏蔽挂机检测',
      message: () =>
        h('p', [
          h('div', '屏蔽B站直播间的挂机检测。'),
          h(
            'div',
            '如果长时间没有操作，会提示“检测到您已离开当前屏幕，倒计时后即将暂停播放”。此外切换标签页或把浏览器切到后台导致直播间页面不可见时，播放器可能会自动切换到低画质或暂停播放。开启本功能即可避免这类情况。',
          ),
        ]),
    },
    invisibility: {
      title: '隐身入场',
      message: () =>
        h('p', [h('div', '进入直播间时其他人不会收到提示，但还是会出现在高能用户榜单上。')]),
    },
  },
  RemoveElement: {
    removePKBox: {
      title: '移除大乱斗元素',
      message: '移除直播间的大乱斗元素（进度条，弹出的提示等）。',
    },
    removeLiveWaterMark: {
      title: '移除直播间水印',
      message: '移除直播画面左上角的水印。',
    },
    removeShopPopover: {
      title: '移除直播间小橙车弹窗',
      message: '移除直播间左上角的小橙车弹窗。',
    },
    removeGameParty: {
      title: '移除直播间幻星派对标志',
      message: '移除直播间右下角的幻星派对标志。',
    },
    removeGiftPopover: {
      title: '移除礼物赠送提示弹窗',
      message: '移除直播间右下角的礼物赠送提示弹窗（赠送一个牛蛙牛蛙支持主播）。',
    },
    removeMicPopover: {
      title: '移除连麦状态提示',
      message: '移除直播间左上角的连麦提示弹窗（连线功能只能在手机端使用，快使用手机登录吧～）。',
    },
    removeComboCard: {
      title: '移除直播间相同弹幕连续提示',
      message: '移除直播间相同弹幕连续提示。',
    },
    removeHeaderStuff: {
      title: '移除直播画面上方杂项',
      message: '移除直播画面上方各种杂七杂八的东西，比如排行榜、活动轮播图等。',
    },
    removeFlipView: {
      title: '移除礼物栏下方广告',
      message: '移除礼物栏下方广告。',
    },
    removeLiveMosaic: {
      title: '移除直播间马赛克',
      message: '移除部分直播间特有的马赛克。',
    },
  },
}

export default helpInfo
